-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Апр 18 2023 г., 09:37
-- Версия сервера: 10.1.48-MariaDB
-- Версия PHP: 8.0.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `dom_tvoy`
--

-- --------------------------------------------------------

--
-- Структура таблицы `houses_items`
--

CREATE TABLE `houses_items` (
  `slider_img` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `id` int(11) NOT NULL,
  `area` int(11) NOT NULL,
  `adress` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` int(11) NOT NULL,
  `current_people` int(11) NOT NULL,
  `for_finish` date NOT NULL,
  `date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `detail_text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `year` int(11) NOT NULL,
  `city` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `street` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `count_room` int(11) NOT NULL,
  `type` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `isNewHouse` tinyint(1) NOT NULL,
  `isBuildHouse` tinyint(1) NOT NULL,
  `isPhoto` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `houses_items`
--

INSERT INTO `houses_items` (`slider_img`, `name`, `id`, `area`, `adress`, `price`, `current_people`, `for_finish`, `date`, `detail_text`, `year`, `city`, `street`, `count_room`, `type`, `isNewHouse`, `isBuildHouse`, `isPhoto`) VALUES
('Pic_frame.png,\r\nPic_frame.png', 'Красивый дом на берегу озера', 2, 0, 'ул. Победы, 123', 400000, 58, '0000-00-00', '2023-04-10 11:43:46', 'Прекрасный вид на озеро, бассейн и сауна в доме', 1969, 'Алматы', 'мкр Жетысу-3', 4, 'Flat', 0, 0, 0),
('second-house.png,\r\nsecond-house.png', 'Квартира 1', 3, 60, 'ул. Абая 1', 10700000, 13, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 1', 2010, 'Алматы', 'ул. Абая', 2, 'Flat', 0, 0, 0),
('', 'Квартира 2', 4, 70, 'ул. Абая 2', 12000000, 10, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 2', 2015, 'Алматы', 'ул. Абая', 2, 'Flat', 0, 0, 0),
('', 'Квартира 3', 5, 80, 'ул. Абая 3', 15000000, 10, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 3', 2020, 'Алматы', 'ул. Абая', 0, '0', 0, 0, 0),
('', 'Квартира 4', 6, 90, 'ул. Абая 4', 18000000, 15, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 4', 2010, 'Алматы', 'ул. Абая', 0, '0', 0, 0, 0),
('', 'Квартира 5', 7, 100, 'ул. Абая 5', 20000000, 12, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 5', 2015, 'Алматы', 'ул. Абая', 0, '0', 0, 0, 0),
('', 'Дом 1', 8, 200, 'ул. Байтурсынова 1', 50000000, 3, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание дома 1', 2000, 'Алматы', 'ул. Байтурсынова', 5, 'House', 0, 0, 0),
('', 'Дом 2', 9, 250, 'ул. Байтурсынова 2', 60000000, 4, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание дома 2', 2010, 'Алматы', 'ул. Байтурсынова', 0, '0', 0, 0, 0),
('', 'Дом 3', 10, 300, 'ул. Байтурсынова 3', 70000000, 2, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание дома 3', 2015, 'Алматы', 'ул. Байтурсынова', 0, '0', 0, 0, 0),
('', 'Квартира 6', 11, 80, 'ул. Абдулина 1', 12000000, 8, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 6', 2015, 'Алматы', 'ул. Абдулина', 0, '0', 0, 0, 0),
('', 'Квартира 7', 12, 90, 'ул. Абдулина 2', 15000000, 12, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 7', 2020, 'Алматы', 'ул. Абдулина', 0, '0', 0, 0, 0),
('', 'Квартира 8', 13, 100, 'ул. Абдулина 3', 18000000, 9, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 8', 2010, 'Алматы', 'ул. Абдулина', 0, '0', 0, 0, 0),
('', 'Квартира 9', 14, 110, 'ул. Абдулина 4', 20000000, 10, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 9', 2015, 'Алматы', 'ул. Абдулина', 0, '0', 0, 0, 0),
('', 'Квартира 10', 15, 120, 'ул. Абдулина 5', 22000000, 7, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 10', 2020, 'Алматы', 'ул. Абдулина', 0, '0', 0, 0, 0),
('', 'Дом 6', 16, 350, 'ул. Бокейханова 1', 70000000, 3, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание дома 6', 2015, 'Алматы', 'ул. Бокейханова', 0, '0', 0, 0, 0),
('', 'Дом 7', 17, 400, 'ул. Бокейханова 2', 80000000, 4, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание дома 7', 2010, 'Алматы', 'ул. Бокейханова', 0, '0', 0, 0, 0),
('', 'Дом 8', 18, 450, 'ул. Бокейханова 3', 90000000, 2, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание дома 8', 2020, 'Алматы', 'ул. Бокейханова', 0, '0', 0, 0, 0),
('', 'Дом 9', 19, 500, 'ул. Бокейханова 4', 100000000, 1, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание дома 9', 2015, 'Алматы', 'ул. Бокейханова', 0, '0', 0, 0, 0),
('', 'Дом 10', 20, 550, 'ул. Бокейханова 5', 110000000, 5, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание дома 10', 2010, 'Алматы', 'ул. Бокейханова', 0, '0', 0, 0, 0),
('', 'Квартира 12', 21, 70, 'ул. Джандосова 2', 11000000, 9, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 12', 2010, 'Алматы', 'ул. Джандосова', 0, '0', 0, 0, 0),
('', 'Квартира 13', 22, 80, 'ул. Джандосова 3', 12000000, 7, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 13', 2020, 'Алматы', 'ул. Джандосова', 0, '0', 0, 0, 0),
('', 'Квартира 14', 23, 90, 'ул. Джандосова 4', 15000000, 8, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 14', 2015, 'Алматы', 'ул. Джандосова', 0, '0', 0, 0, 0),
('', 'Квартира 15', 24, 100, 'ул. Джандосова 5', 18000000, 10, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание квартиры 15', 2010, 'Алматы', 'ул. Джандосова', 0, '0', 0, 0, 0),
('', 'Дом 11', 25, 400, 'ул. Назарбаева 1', 90000000, 4, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание дома 11', 2015, 'Алматы', 'ул. Назарбаева', 0, '0', 0, 0, 0),
('', 'Дом 12', 26, 450, 'ул. Назарбаева 2', 100000000, 3, '0000-00-00', '2023-04-10 15:18:28', 'Текстовое описание дома 12', 2020, 'Алматы', 'ул. Назарбаева', 0, '0', 0, 0, 0);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `houses_items`
--
ALTER TABLE `houses_items`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `houses_items`
--
ALTER TABLE `houses_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
